<?php

?>
    <link rel="stylesheet" href="css/about_us.css">
    <title>公司简介</title>
    <?php require_once ('header.php');?>

        <!-- content -->
        <div class="content">
            <!-- 文章 -->
            <article class="fl">
                <div>
                    <h2>公司简介<span> About us</span></h2>
                </div>
                <img src="images/main2_about.jpg" alt="">
                <p>在过去的六个交易日中，国际油价连续上涨6.84美元，累计涨幅超过8%。据东方油气网监测，在3月29日后，国际油价突然发力大幅上扬，3月29
                    日上涨至每桶82美元以上，31日达83.76美元，4月1日达84.87美元，4月5日上涨至86.62美元。</p>
                <p>业内人士认为，经济数据向好以及进入消费旺季等利多因素共振推动石油市场价格急剧攀升。中国石油大学工商管理学院院长王震分析说，当前国际油</p>
                <p>从去年11月10日至今近半年的时间里，国内油价始终都没有调整，原因在于布伦特、迪拜、辛塔三地原油变化率曾先后3次临界破4%，但都在临界破 4%最后的关键几天里转了向。</p>
                <p>按照《石油价格管理办法》规定，“国际市场原油连续22个工作日移动平均价格变化超过4%时，可相应调整国内成品油价格”。据东方油气网监测，截至4月6日，布伦特、迪拜和辛塔三地原油变化率已达4.78%。
                </p>
                <p>由于进入4月份后，国内原油结算价将比前月上涨200余元，若不调整出厂价，炼油盈利将持平或略显亏损。预计，这次调价可能仍以满足炼油不亏损为前提，综合考虑当前CPI(居民消费价格指数)，调幅可能有所控制。
                </p>
                <p>据东方油气网监测，从去年第四季度至今半年多的时间里，在供求关系及竞争格局的作用下，只要没有调价预期干扰，实际批发价远远达不到规定的批发最高限价，基本呈现着与出厂价一致的“厂批同价”的实际批发价格局。
                </p>

            </article>



    <?php
        require_once ('aside.php');
        require_once ('footer.php');
    ?>