<?php

    function match($reg,$str){
        if (preg_match($reg,$str,$arr)){
            echo "{$str} 和规则 {$reg} 匹配成功 <pre>";
            print_r($arr);
        }else{
            echo '匹配失败！';
        }
    }

    echo '<pre>';
    // 1. 验证email
    echo '<br> 1.验证email <hr/>';
    $reg = '/^[\D\d]+@[\D\d]+\.[a-zA-Z]+$/i';
    $str = 'yux_shaw123@vip123.com';
    match($reg,$str);


    // 2. 验证手机号码
    echo '<br><br> 2.验证手机号码 <hr>';
    $reg = '/^(13[0-9]|14[5-67]|15[0-9]|166|17[0-8]|18[0-9]|19[1-189])\d{8}$/';
    $str = 19887654321;
    match($reg,$str);


    // 3. 验证网址
    echo '<br><br> 3.验证网址 <hr>';
    $reg = '/^(https?|ftp):\/\/([a-z]+\.)?[a-zA-Z0-9]+\.[a-z]{2,}(\.[a-z]{2,})?(\/[\w\d]+)?(\?[\D\d]+)?$/i';
    $str = 'http://myblog.com?id=1&name=abc';
//    $str = 'ftp://www.faf32.com/imgs2';
    match($reg,$str);


    // 4.验证身份证
    echo '<br><br> 4.验证身份证 <hr>';
    //3 60732 1 998 06 09 111 1
    $reg = '/^[1-9]\d{5}((1\d{3}(0\d|1[0-2])(([0-2]\d)|3[0-1]))|(20[0-1][1-8](0\d|1[0-2])(([0-2]\d)|3[0-1]))|(20190[0-6](([0-2]\d)|3[0-1])))\d{3}(\d|x|X)$/';
    //  '/^[1-9]\d{5}(1[0-9]{3}|20[0-1]\d)(0\d|1[0-2])(([0-2]\d)|3[0-1])\d{3}(\d|x|X)$/'
    //  "/^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2])) (([0|1|2]\d)|3[0-1])\d{3}(\d|x|X)$/"
    $str = '36073219960605283x';
    match($reg,$str);


    // 5.验证日期
    echo '<br><br> 5.验证日期 <hr>';
//    $reg = '/^((1\d{3})|(20[0-1]\d))(-|\/|\年)((0\d|1[0-2]))(-|\/|\月)([0-2]\d)|3[0-1])(\日)?$/';
    $reg = '/^[1-2]\d{3}(-|\/|\年)((0\d)|(1[0-2]))(-|\/|\月)(([0-2]\d)|(3[0-1]))(\日)?$/';
    $str = '2019/06/01';
    match($reg,$str);


    // 6. 验证QQ号
    echo '<br><br> 6.验证QQ号 <hr>';
    $reg = '/^(([1-9]\d{5})|([1-9]\d{6})|([1-9]\d{7})|([1-9]\d{8})|([1-3]\d{9}))$/';
    $str = '3234567890';
    match($reg,$str);









    echo '<br><br>  <hr>';
//    for ($i=1; $i<=100; $i++){
//        if($i%3 == 0){
//            echo 'three<br/>';
//        }elseif ($i%5 == 0){
//            echo 'five<br/>';
//        }elseif ($i%3==0 && $i%5==0){
//            echo 'threefive<br/>';
//        }else{
//            echo $i.'<br>';
//        }
//    }